#include <iostream>

using namespace std;

int main()
{
    setlocale(0, "RUS");
    // 1
    cout << "1\n";
    cout << "----------------------\n";
    cout << "\tАпрель\n";
    cout << "----------------------\n";
    cout << " пн вт ср чт пт сб вс\n";
    cout << "                 1  2\n";
    cout << "  3  4  5  6  7  8  9\n";
    cout << " 10 11 12 13 14 15 16\n";
    cout << " 17 18 19 20 21 22 23\n";
    cout << " 24 25 26 27 28 29 30\n";
    cout << "----------------------\n\n";
    //2
    cout << "2\n";
    cout << "                          ******\n";
    cout << "                        ***\n";
    cout << "            ________    *\n";
    cout << "           /        \\  _\n";
    cout << "          /    __    \\| |\n";
    cout << "         /    |  |    \\ |\n";
    cout << "        /     |__|     \\|\n";
    cout << "       /________________\\\n";
    cout << "        |   __    __   |\n";
    cout << "        |  |__|  | ,|  |^.^.^.^.^.^.^.^.^.\n";
    cout << "        |        |  |  | | | | | | | | | |\n\n";
    //3
    cout << "3\n";
    cout << "         ****  **  **   *****\n";
    cout << "        *****  **  **  *** **\n";
    cout << "       **  **  **  **  **  **\n";
    cout << "      **   **  ******   *****\n";
    cout << "     ********  **  **    * **\n";
    cout << "    **     **  **  **   ** **\n";
    cout << "   **      **  **  **  **  **\n\n";
    //4
    cout << "4\n";
    cout << "\t          *\n";
    cout << "\t  *            *\n";
    cout << "\t                       *           *\n";
    cout << "\n\n";
    cout << "\t                        *         *\n\n";
    //5
    cout << "5\n";
    cout << "------------------------------\n";
    cout << "\t    Резюме\n";
    cout << "------------------------------\n";
    cout << "\t Разработчик\n";
    cout << " ФИО: Маркова Анна Руслановна\n";
    cout << " Дата рождения: 14.12.2006\n";
    cout << " Образование:\n";
    cout << " - Среднее общее (Лицей №100)\n";
    cout << " - Курс по разработке ПО (Шаг)\n";
    cout << " Положительные качества:\n";
    cout << " - Ответственность\n";
    cout << " - Любовь к работе\n";
    cout << " - Усердие\n";
    cout << " Отрицательные качества:\n";
    cout << " - При высокой зарплате\n";
    cout << " отсутствуют\n";
    cout << "------------------------------\n";
}
